{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "D_Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 6, 6, 6, 128], "dtype": "float32", "sparse": false, "name": "D_Input"}, "inbound_nodes": []}, {"name": "D_Conv1", "class_name": "Conv3DTranspose", "config": {"name": "D_Conv1", "trainable": true, "filters": 96, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["D_Input", 0, 0, {}]]]}, {"name": "D_Conv2", "class_name": "Conv3D", "config": {"name": "D_Conv2", "trainable": true, "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["D_Conv1", 0, 0, {}]]]}, {"name": "up_sampling3d_1", "class_name": "UpSampling3D", "config": {"name": "up_sampling3d_1", "trainable": true, "size": [2, 2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["D_Conv2", 0, 0, {}]]]}, {"name": "D_Conv3", "class_name": "Conv3D", "config": {"name": "D_Conv3", "trainable": true, "filters": 48, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling3d_1", 0, 0, {}]]]}, {"name": "D_Conv4", "class_name": "Conv3D", "config": {"name": "D_Conv4", "trainable": true, "filters": 32, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["D_Conv3", 0, 0, {}]]]}, {"name": "up_sampling3d_2", "class_name": "UpSampling3D", "config": {"name": "up_sampling3d_2", "trainable": true, "size": [2, 2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["D_Conv4", 0, 0, {}]]]}, {"name": "D_Conv5", "class_name": "Conv3D", "config": {"name": "D_Conv5", "trainable": true, "filters": 16, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling3d_2", 0, 0, {}]]]}, {"name": "up_sampling3d_3", "class_name": "UpSampling3D", "config": {"name": "up_sampling3d_3", "trainable": true, "size": [2, 2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["D_Conv5", 0, 0, {}]]]}, {"name": "D_Conv6", "class_name": "Conv3D", "config": {"name": "D_Conv6", "trainable": true, "filters": 4, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling3d_3", 0, 0, {}]]]}], "input_layers": [["D_Input", 0, 0]], "output_layers": [["D_Conv6", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}