{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "Init_Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 48, 48, 48, 4], "dtype": "float32", "sparse": false, "name": "Init_Input"}, "inbound_nodes": []}, {"name": "E_Conv_1", "class_name": "Conv3D", "config": {"name": "E_Conv_1", "trainable": true, "filters": 16, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Init_Input", 0, 0, {}]]]}, {"name": "E_Conv_2", "class_name": "Conv3D", "config": {"name": "E_Conv_2", "trainable": true, "filters": 32, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["E_Conv_1", 0, 0, {}]]]}, {"name": "max_pooling3d_1", "class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_1", "trainable": true, "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["E_Conv_2", 0, 0, {}]]]}, {"name": "E_Conv_3", "class_name": "Conv3D", "config": {"name": "E_Conv_3", "trainable": true, "filters": 48, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]]}, {"name": "E_Conv_4", "class_name": "Conv3D", "config": {"name": "E_Conv_4", "trainable": true, "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["E_Conv_3", 0, 0, {}]]]}, {"name": "max_pooling3d_2", "class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_2", "trainable": true, "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["E_Conv_4", 0, 0, {}]]]}, {"name": "E_Conv_5", "class_name": "Conv3D", "config": {"name": "E_Conv_5", "trainable": true, "filters": 96, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]]}, {"name": "max_pooling3d_3", "class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_3", "trainable": true, "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["E_Conv_5", 0, 0, {}]]]}, {"name": "E_Conv_6", "class_name": "Conv3D", "config": {"name": "E_Conv_6", "trainable": true, "filters": 128, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling3d_3", 0, 0, {}]]]}, {"name": "V_Mean", "class_name": "Dense", "config": {"name": "V_Mean", "trainable": true, "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["E_Conv_6", 0, 0, {}]]]}, {"name": "V_Sig", "class_name": "Dense", "config": {"name": "V_Sig", "trainable": true, "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["E_Conv_6", 0, 0, {}]]]}, {"name": "V_Var", "class_name": "Lambda", "config": {"name": "V_Var", "trainable": true, "function": ["4wEAAAAAAAAABgAAAAUAAABDAAAAc0IAAAB8AFwDfQF9An0DdABqAXwBgwF9BHQAagJ8BGQBZACF\nAhkAZAJkA2QEjQN9BXwCdABqA3wDZAUbAIMBfAUUABcAUwApBk7pAQAAAOcAAAAAAAAAAOcAAAAA\nAADwPykD2gVzaGFwZdoEbWVhbtoGc3RkZGV26QIAAAApBNoBS9oJaW50X3NoYXBl2g1yYW5kb21f\nbm9ybWFs2gNleHApBtoEYXJnc9oBeNoGel9tZWFu2gl6X2xvZ192YXLaF3NoYXBlX2JlZm9yZV9m\nbGF0dGVuaW5n2gdlcHNpbG9uqQByEgAAAPoIVkFFXzEucHnaCHNhbXBsaW5nOAAAAHMIAAAAAAEK\nAQoBGAE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["E_Conv_6", 0, 0, {}], ["V_Mean", 0, 0, {}], ["V_Sig", 0, 0, {}]]]}], "input_layers": [["Init_Input", 0, 0]], "output_layers": [["V_Mean", 0, 0], ["V_Sig", 0, 0], ["V_Var", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}